       *> COBOL DCLGEN for table   PAD1
       *> Generated for use in COBOL programs

       01  PAD1-REC.

           05 PAD1-RECORD.

              10  PAYMENT-ID      PIC X(10).  
              10  PAYMENT-DATE    PIC X(10).  
              10  PAYMENT-USER    PIC X(8).   
  