             *> COBOL DCLGEN for table   PAD1
       *> Generated for use in COBOL programs
       01  PAD1-REC.
           05  PAYMENT-ID      PIC X(10).  
           *> Unique identifier 
           05  PAYMENT-DATE    PIC X(10).  
           *> Date (formatted YYYY-MM-DD)
           05  PAYMENT-USER    PIC X(8).   
           *> User of the PAYMENT
  