       IDENTIFICATION DIVISION.
       PROGRAM-ID.     PAM1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       COPY PAD1SQL.
       COPY CAD1SQL.
       EXEC SQL INCLUDE PAD1REC END-EXEC.
       EXEC SQL INCLUDE CAD1REC END-EXEC.
       EXEC SQL INCLUDE SQLCA   END-EXEC.

       LINKAGE SECTION.

       COPY BAM1.
       COPY PAM1.

       PROCEDURE DIVISION
           USING PAM1-COMM-AREA.

       MAIN-PROCESS.

           PERFORM INITIALIZE-COMM-AREA
           PERFORM PROCESS-PAYMENT
           GOBACK.

       INITIALIZE-COMM-AREA.

           MOVE SPACES TO PAM1-COMM-AREA.

       PROCESS-PAYMENT.

           EXEC SQL
               SELECT CUSTOMER_DATE, CUSTOMER_USER
               INTO :CUSTOMER-DATE, :CUSTOMER-USER
               FROM CAD1
               WHERE CUSTOMER_ID = :CAD1-REC.CUSTOMER-ID
           END-EXEC.


           EXEC SQL
               SELECT PAYMENT_DATE, PAYMENT_USER
               INTO :PAYMENT-DATE, :PAYMENT-USER
               FROM    PAD1
               WHERE PAYMENT_ID = :PAD1-REC.PAYMENT-ID
           END-EXEC.

           IF SQLCODE = 0
               MOVE 'S' TO PAYMENT-STATUS
           ELSE
               MOVE 'E' TO PAYMENT-STATUS