       *> COBOL DCLGEN for table CAD1
       *> Generated for use in COBOL programs
       01  CAD1-REC.
           05  CUSTOMER-ID      PIC X(10).  
           *> Unique identifier 
           05  CUSTOMER-DATE    PIC X(10).  
           *> Date (formatted YYYY-MM-DD)
           05  CUSTOMER-USER    PIC X(8).   
           *> User of the CUSTOMER
  