       *> COBOL DCLGEN for table CAD1
       *> Generated for use in COBOL programs

       01  CAD1-REC.
       
           05 CAD1-RECORD.
              
              10  CUSTOMER-ID      PIC X(10).  
              10  CUSTOMER-DATE    PIC X(10).  
              10  CUSTOMER-USER    PIC X(8).   
  