       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAM1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       COPY CAD1SQL.
       COPY BAD1SQL.
       EXEC SQL INCLUDE CAD1REC END-EXEC.
       EXEC SQL INCLUDE BAD1REC END-EXEC.
       EXEC SQL INCLUDE SQLCA   END-EXEC.

       LINKAGE SECTION.

       COPY CAM1.

       PROCEDURE DIVISION
           USING CAM1-COMM-AREA.

       MAIN-PROCESS.

           PERFORM INITIALIZE-COMM-AREA
           PERFORM PROCESS-TRANSACTION
           PERFORM RETURN-TO-CALLER

           GOBACK.

       INITIALIZE-COMM-AREA.

           MOVE SPACES TO CAM1-COMM-AREA.

       PROCESS-TRANSACTION.

           EXEC SQL
               SELECT TRANSACTION_DATE, TRANSACTION_USER
               INTO :TRANSACTION-DATE, :TRANSACTION-USER
               FROM BAD1
               WHERE TRANSACTION_ID = :BAD1-REC.TRANSACTION-ID
           END-EXEC.


           EXEC SQL
               SELECT CUSTOMER_DATE, CUSTOMER_USER
               INTO :CUSTOMER-DATE, :CUSTOMER-USER
               FROM CAD1
               WHERE CUSTOMER_ID = :CAD1-REC.CUSTOMER-ID
           END-EXEC.

           IF SQLCODE = 0
               MOVE 'S' TO CUSTOMER-STATUS
           ELSE
               MOVE 'E' TO CUSTOMER-STATUS
               MOVE SQLERRMC TO ERROR-MESSAGE
               MOVE SQLCODE TO RETURN-CD.



       RETURN-TO-CALLER.

           DISPLAY "Module CAM1 ended with status: " CUSTOMER-STATUS.

           IF CUSTOMER-STATUS = 'E'
               DISPLAY "Error: " ERROR-MESSAGE.