       *> COBOL DCLGEN for table BAD1
       *> Generated for use in COBOL programs

       01 BAD1-REC.

          05 BAD1-RECORD.

             10 TRANSACTION-ID      PIC X(10).
             10 TRANSACTION-DATE    PIC X(10).
             10 TRANSACTION-USER    PIC X(8).