//JOBNAME  JOB (ACCT),'RUN PAB1',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//STEP01   EXEC PGM=PAB1
//STEPLIB  DD DISP=SHR,DSN=YOUR.LOAD.LIBRARY
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DUMMY